In [1]:
import duckdb as duckdb
import pandas as pd
import os
from datetime import datetime

In [5]:
con = duckdb.connect(database='dados_duckdb.db', read_only=False)

In [19]:
arquivo = 'z0019_1.csv'
data_ingestao = datetime.now()
df = pd.read_csv(f'../landing/{arquivo}', sep=';')
df['nome_arquivo'] = arquivo
df['data_ingestao'] = data_ingestao
df.head()

   NARBR     MAKTX WERKS  MAINS  LABST nome_arquivo              data_ingestao
0  10001  PARAFUSO  BT10    100    100  z0019_1.csv 2026-01-04 08:56:49.883106
1  10002    MATELO  BT50    100   1500  z0019_1.csv 2026-01-04 08:56:49.883106
2  10003     PREGO  BT10    100     50  z0019_1.csv 2026-01-04 08:56:49.883106

In [20]:
con.execute("""
CREATE TABLE IF NOT EXISTS bronze_produtos (
    NARBR VARCHAR,
    MAKTX VARCHAR,
    WERKS VARCHAR,
    MAINS VARCHAR,
    LABST VARCHAR,
    nome_arquivo VARCHAR,
    data_ingestao TIMESTAMP
);
""")

In [21]:
con.execute("INSERT INTO bronze_produtos SELECT * FROM df")

In [22]:
result = con.execute("select * from bronze_produtos").fetchdf()
result.head(6)

   NARBR     MAKTX WERKS MAINS LABST nome_arquivo              data_ingestao
0  10004     SERRA  BT50   100   200  z0019_2.csv 2026-01-04 08:54:48.921266
1  10005   MACHADO  BT50   100   100  z0019_2.csv 2026-01-04 08:54:48.921266
2  10003     PREGO  BT10   100    60  z0019_2.csv 2026-01-04 08:54:48.921266
3  10001  PARAFUSO  BT10   100   100  z0019_1.csv 2026-01-04 08:56:49.883106
4  10002    MATELO  BT50   100  1500  z0019_1.csv 2026-01-04 08:56:49.883106
5  10003     PREGO  BT10   100    50  z0019_1.csv 2026-01-04 08:56:49.883106

In [23]:
con.execute("ALTER TABLE bronze_produtos RENAME TO bronze_Z0019")

In [24]:
resultado = con.execute("select * from bronze_Z0019").fetchdf()
resultado.head(6)

   NARBR     MAKTX WERKS MAINS LABST nome_arquivo              data_ingestao
0  10004     SERRA  BT50   100   200  z0019_2.csv 2026-01-04 08:54:48.921266
1  10005   MACHADO  BT50   100   100  z0019_2.csv 2026-01-04 08:54:48.921266
2  10003     PREGO  BT10   100    60  z0019_2.csv 2026-01-04 08:54:48.921266
3  10001  PARAFUSO  BT10   100   100  z0019_1.csv 2026-01-04 08:56:49.883106
4  10002    MATELO  BT50   100  1500  z0019_1.csv 2026-01-04 08:56:49.883106
5  10003     PREGO  BT10   100    50  z0019_1.csv 2026-01-04 08:56:49.883106

In [25]:
con.close()